vlocity/DataRaptor/DR_DirectDebitUpdateAccount/DR_DirectDebitUpdateAccount_TargetOutXml.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:emis="http://services.thelogicgroup.biz/EMIS_WEBPAYMENT_1_0">
   <soapenv:Header/>
   <soapenv:Body>
<tns:UpdateAccountRequest xmlns:tns="https://xmlns.three.co.uk/xsd/accountmanagementservices/manageaccount/v1" xmlns:tib="http://www.tibco.com/bw/xslt/custom-functions" xmlns:tns1="http://www.ibm.com/telecom/v8.5.0/businessobject/system/sid-v12.5/common" xmlns:tns2="http://www.ibm.com/telecom/v8.5.0/businessobject/system/sid-v12.5/systemview" xmlns:tns3="http://TPCMN" xmlns:tns4="http://www.ibm.com/software/issw/telecom/pack/v8.5.0/lite/businessobject/system/common/extension" xmlns:tns5="http://www.ibm.com/software/issw/telecom/pack/v8.5.0/lite/businessobject/system/sid-v12.5" xmlns:tns6="http://www.ibm.com/software/issw/telecom/pack/v8.5.0/lite/businessobject/system/billing/extension" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <Header>
    <tns1:CorrelationId_T>27927fd6-4459-47df-9674-0ae9cc73e4ed</tns1:CorrelationId_T>
    <tns1:ActivityName_T>UpdateAccount</tns1:ActivityName_T>
    <tns1:MsgType_T>REQUEST</tns1:MsgType_T>
    <tns1:Source>CRM</tns1:Source>
    <tns1:MessageId>41056fa8-c094-4b50-b85e-04936a9f30af</tns1:MessageId>
    <tns1:Timestamp>2019-02-22T06:53:59.764Z</tns1:Timestamp>
  </Header>
  <Payload>
    <tns2:ID>
      <tns1:ID>1234567</tns1:ID>
      <tns1:name>CURRENT</tns1:name>
      <tns1:ValidFor>
        <tns1:startDate>2019-02-22T06:53:59.764Z</tns1:startDate>
      </tns1:ValidFor>
    </tns2:ID>
    <tns2:accountType>BILLING</tns2:accountType>
    <tns2:accountStatus>Active</tns2:accountStatus>
    <tns2:creditLimit>
      <tns2:amount>1.0E2</tns2:amount>
    </tns2:creditLimit>
    <tns2:Customer>
      <tns2:AdditionalInformation>
        <tns1:name>Disability</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>false</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>Fraud</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>fasle</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>VIP</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>fasle</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>Deceased</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>fasle</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>goneAway</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>fasle</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>armedForces</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>fasle</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>Hospitalised</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>fasle</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>Bankrupt</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>fasle</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>inPrisonBillingSuspension</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>fasle</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>inPrisonSpecialStrategy</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>fasle</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>preferredPaymentDay</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>5</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>reportLevel</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>5</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>custClassification</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>5</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>accountingMethod</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>5</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>collectionsReasonCode</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>5</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>adminOrder</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>5</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>IVA</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>5</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>Sequestration</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>5</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
      <tns2:AdditionalInformation>
        <tns1:name>trustedDeed</tns1:name>
        <tns1:Value>
          <tns1:CharacteristicValue>
            <tns1:value>5</tns1:value>
          </tns1:CharacteristicValue>
        </tns1:Value>
      </tns2:AdditionalInformation>
    </tns2:Customer>
    <tns2:CustomerAccountPartyRole>
      <tns1:ID>
        <tns1:type>Business</tns1:type>
        <tns1:ValidFor>
          <tns1:startDate>2019-02-22T06:53:59.764Z</tns1:startDate>
          <tns1:endDate>2019-02-22T06:53:59.764Z</tns1:endDate>
        </tns1:ValidFor>
      </tns1:ID>
      <tns1:roleType>Owner</tns1:roleType>
      <tns1:ContactMedium>
        <tns1:PostalAddress>
          <tns3:ID>
            <tns1:type>BILLING</tns1:type>
          </tns3:ID>
          <tns3:addressLine1>25th cross</tns3:addressLine1>
          <tns3:addressLine2>MN Nagar</tns3:addressLine2>
          <tns3:GeographicAddress>
            <tns1:UrbanPropertyAddress>
              <tns1:streetName>Nehru Street</tns1:streetName>
              <tns1:locality>TINDI</tns1:locality>
              <tns1:postcode>604001</tns1:postcode>
              <tns1:UrbanPropertySubAddress>
                <tns1:buildingName>ShreyasBuilding</tns1:buildingName>
                <tns1:UnbanPropertySubAddressExtension>
                  <tns4:buildingNumber>BUILDING11</tns4:buildingNumber>
                </tns1:UnbanPropertySubAddressExtension>
              </tns1:UrbanPropertySubAddress>
              <tns1:UnbanPropertyAddressExtension>
                <tns4:dependentStreetName>1stStreet</tns4:dependentStreetName>
                <tns4:doubleDependentLocality>aaa</tns4:doubleDependentLocality>
                <tns4:dependentLocality>aaa</tns4:dependentLocality>
                <tns4:BFPO>123</tns4:BFPO>
                <tns4:POBox>123</tns4:POBox>
              </tns1:UnbanPropertyAddressExtension>
            </tns1:UrbanPropertyAddress>
            <tns1:stateOrProvince>TN</tns1:stateOrProvince>
            <tns1:country>India</tns1:country>
            <tns1:GeographicAddressExtension>
              <tns4:latitude>LAT1123</tns4:latitude>
              <tns4:longitude>LONG123</tns4:longitude>
            </tns1:GeographicAddressExtension>
          </tns3:GeographicAddress>
        </tns1:PostalAddress>
        <tns1:eMailAddress>test123@gmail.com</tns1:eMailAddress>
        <tns1:telephoneNumber>
          <tns3:number>7893692418</tns3:number>
          <tns3:type>work</tns3:type>
        </tns1:telephoneNumber>
      </tns1:ContactMedium>
      <tns1:status>Active</tns1:status>
      <tns1:Party>
        <tns1:partyID>P1234</tns1:partyID>
        <tns1:Individual>
          <tns1:IndividualName>
            <tns1:familyNames>K</tns1:familyNames>
            <tns1:givenNames>Sasi</tns1:givenNames>
            <tns1:formOfAddress>S</tns1:formOfAddress>
          </tns1:IndividualName>
          <tns1:gender>Female</tns1:gender>
          <tns1:maritalStatus>Married</tns1:maritalStatus>
          <tns1:AliveDuring>
            <tns1:startDate>2019-02-22T06:53:59.764Z</tns1:startDate>
          </tns1:AliveDuring>
        </tns1:Individual>
        <tns1:Organization>
          <tns1:OrganizationName>
            <tns1:tradingName>SPORG123</tns1:tradingName>
            <tns1:nameType>OrgNameType</tns1:nameType>
          </tns1:OrganizationName>
          <tns1:type>ORGType</tns1:type>
        </tns1:Organization>
      </tns1:Party>
    </tns2:CustomerAccountPartyRole>
    <tns2:CustomerBill>
      <tns2:CustomerBillSpec>
        <tns5:ID>
          <tns1:name>BILName</tns1:name>
        </tns5:ID>
        <tns5:CustomerBillFormat>
          <tns5:CustomerBillPresentationMedia>
            <tns5:ID>
              <tns1:name>MediaName</tns1:name>
            </tns5:ID>
          </tns5:CustomerBillPresentationMedia>
          <tns5:CharacteristicSpecification>
            <tns1:name>Itemised</tns1:name>
            <tns1:Value>
              <tns1:CharacteristicValue>
                <tns1:value>true</tns1:value>
              </tns1:CharacteristicValue>
            </tns1:Value>
          </tns5:CharacteristicSpecification>
          <tns5:CharacteristicSpecification>
            <tns1:name>ItemisedMasking</tns1:name>
            <tns1:Value>
              <tns1:CharacteristicValue>
                <tns1:value>true</tns1:value>
              </tns1:CharacteristicValue>
            </tns1:Value>
          </tns5:CharacteristicSpecification>
          <tns5:CharacteristicSpecification>
            <tns1:name>BillInserts</tns1:name>
            <tns1:Value>
              <tns1:CharacteristicValue>
                <tns1:value>true</tns1:value>
              </tns1:CharacteristicValue>
            </tns1:Value>
          </tns5:CharacteristicSpecification>
        </tns5:CustomerBillFormat>
      </tns2:CustomerBillSpec>
    </tns2:CustomerBill>
    <tns2:PaymentPlan>
      <tns2:status>Activated</tns2:status>
      <tns2:CustomerPayment>
        <tns2:amount>
          <tns2:amount>888888888</tns2:amount>
          <tns2:unitsOrCurrency>GBR</tns2:unitsOrCurrency>
        </tns2:amount>
        <tns2:PaymentMethod>
          <tns2:paymentMethodType>Direct Debit</tns2:paymentMethodType>
          <tns2:CreditCardPM>
            <tns2:ID>
              <tns1:name>Shilpa</tns1:name>
            </tns2:ID>
            <tns2:creditCardNumber>123</tns2:creditCardNumber>
          </tns2:CreditCardPM>
          <tns2:DirectDepositPM>
            <tns2:ID>
              <tns1:ID>2222</tns1:ID>
            </tns2:ID>
            <tns2:depositTransactionID>12345678</tns2:depositTransactionID>
            <tns2:depositDateTime>2019-02-22T06:53:59.764Z</tns2:depositDateTime>
            <tns2:exchangeID>EX123</tns2:exchangeID>
            <tns2:DirectDepositPMExtension>
              <tns6:bankAccountNumber>ACC1234</tns6:bankAccountNumber>
              <tns6:bankAccountName>ACCNameSASI</tns6:bankAccountName>
              <tns6:bankIDNumber>BANK123</tns6:bankIDNumber>
            </tns2:DirectDepositPMExtension>
          </tns2:DirectDepositPM>
        </tns2:PaymentMethod>
      </tns2:CustomerPayment>
      <tns2:PaymentMethod>
        <tns2:paymentMethodType>RTA</tns2:paymentMethodType>
      </tns2:PaymentMethod>
    </tns2:PaymentPlan>
  </Payload>
</tns:UpdateAccountRequest>
</soapenv:Body>
</soapenv:Envelope>